tests/app/config/packages/test/models/shopping-cart/shopping-cart.dot
digraph workflow {
  ratio="compress" rankdir="LR" label=""
  node [fontsize="9" fontname="Arial" color="#333333" fillcolor="lightblue" fixedsize="false" width="1"];
  edge [fontsize="9" fontname="Arial" color="#333333" arrowhead="normal" arrowsize="0.5"];

  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="home", shape=circle, style="filled"];
  place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 [label="category", shape=circle];
  place_38a007151abe87cc01a5b6e9cc418e85286e2087 [label="product", shape=circle];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="cart", shape=circle];
  place_d5491e7e7124a22dd73fa746ba129c59f9dc6d5d [label="checkout", shape=circle];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 [label="viewAnyCategoryFromHome" style="solid"];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> place_38a007151abe87cc01a5b6e9cc418e85286e2087 [label="viewProductFromHome" style="solid"];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="viewCartFromHome" style="solid"];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> place_d5491e7e7124a22dd73fa746ba129c59f9dc6d5d [label="checkoutFromHome" style="solid"];
  place_e83249bd3ba79932e16fb1fb5100dafade9954c2 -> place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="addFromHome" style="solid"];
  place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 -> place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 [label="viewOtherCategory" style="solid"];
  place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 -> place_38a007151abe87cc01a5b6e9cc418e85286e2087 [label="viewProductFromCategory" style="solid"];
  place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="viewCartFromCategory" style="solid"];
  place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 -> place_d5491e7e7124a22dd73fa746ba129c59f9dc6d5d [label="checkoutFromCategory" style="solid"];
  place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 -> place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="backToHomeFromCategory" style="solid"];
  place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 -> place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 [label="addFromCategory" style="solid"];
  place_38a007151abe87cc01a5b6e9cc418e85286e2087 -> place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 [label="viewAnyCategoryFromProduct" style="solid"];
  place_38a007151abe87cc01a5b6e9cc418e85286e2087 -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="viewCartFromProduct" style="solid"];
  place_38a007151abe87cc01a5b6e9cc418e85286e2087 -> place_d5491e7e7124a22dd73fa746ba129c59f9dc6d5d [label="checkoutFromProduct" style="solid"];
  place_38a007151abe87cc01a5b6e9cc418e85286e2087 -> place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="backToHomeFromProduct" style="solid"];
  place_38a007151abe87cc01a5b6e9cc418e85286e2087 -> place_38a007151abe87cc01a5b6e9cc418e85286e2087 [label="addFromProduct" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_5ccbf9c9c5fc1bc34df8238a97094968f38f5165 [label="viewAnyCategoryFromCart" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_38a007151abe87cc01a5b6e9cc418e85286e2087 [label="viewProductFromCart" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_d5491e7e7124a22dd73fa746ba129c59f9dc6d5d [label="checkoutFromCart" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="backToHomeFromCart" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="update" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="remove" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="useCoupon" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="estimateShippingAndTaxes" style="solid"];
  place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="useGiftCertificate" style="solid"];
  place_d5491e7e7124a22dd73fa746ba129c59f9dc6d5d -> place_8bfb4e1aa590eab8f08f837b97acf5803a5737ed [label="viewCartFromCheckout" style="solid"];
  place_d5491e7e7124a22dd73fa746ba129c59f9dc6d5d -> place_e83249bd3ba79932e16fb1fb5100dafade9954c2 [label="backToHomeFromCheckout" style="solid"];
}
