tests/app/config/packages/test/models/shopping-cart/shopping-cart.plantuml
@startuml
allow_mixing
title shopping_cart
skinparam titleBorderRoundCorner 15
skinparam titleBorderThickness 2
skinparam state {
    BackgroundColor<<initial>> #87b741
    BackgroundColor<<marked>> #3887C6
    BorderColor #3887C6
    BorderColor<<marked>> Black
    FontColor<<marked>> White
}
state "home" <<initial>>
state "category"
state "product"
state "cart"
state "checkout"
"home" --> "category": "viewAnyCategoryFromHome"
"category" --> "category": "viewOtherCategory"
"product" --> "category": "viewAnyCategoryFromProduct"
"cart" --> "category": "viewAnyCategoryFromCart"
"home" --> "product": "viewProductFromHome"
"cart" --> "product": "viewProductFromCart"
"category" --> "product": "viewProductFromCategory"
"home" --> "cart": "viewCartFromHome"
"category" --> "cart": "viewCartFromCategory"
"product" --> "cart": "viewCartFromProduct"
"checkout" --> "cart": "viewCartFromCheckout"
"home" --> "checkout": "checkoutFromHome"
"category" --> "checkout": "checkoutFromCategory"
"product" --> "checkout": "checkoutFromProduct"
"cart" --> "checkout": "checkoutFromCart"
"category" --> "home": "backToHomeFromCategory"
"product" --> "home": "backToHomeFromProduct"
"cart" --> "home": "backToHomeFromCart"
"checkout" --> "home": "backToHomeFromCheckout"
"cart" --> "cart": "update"
"cart" --> "cart": "remove"
"cart" --> "cart": "useCoupon"
"cart" --> "cart": "estimateShippingAndTaxes"
"cart" --> "cart": "useGiftCertificate"
"home" --> "home": "addFromHome"
"category" --> "category": "addFromCategory"
"product" --> "product": "addFromProduct"
@enduml
